org/Higher_prequantum_geometry_by_Urs_Schreiber_in_2017.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Higher_prequantum_geometry_by_Urs_Schreiber_in_2017
#+TITLE: Higher prequantum geometry by Urs Schreiber in 2017
* 1. Prequantum field theory
** 1.1 The need for prequantum geometry
*** The Faraday tensor $$F$$ encodes the classical Lorentz force that the electromagnetic field on a spacetime $$X$$ exerts on an electron (propagating in that field).
*** Within a particular region $$U$$ the quantum electron couples to the vector potential which is a differential 1-form $$A_U$$, such that $$dA_U = F|_U$$. This is to say that the differential of the vector potential within the region $$U$$ is equivalent to the restriction of the global Faraday tensor $$F$$ to the given region.
*** To define the quantized electron globally requires lifting of the locally defined vector potentials to an $$\mathbb{R}/\mathbb{Z}$$-principal connection on a $$\mathbb{R}/\mathbb{Z}$$-[[file:principal_bundle.org][principal bundle]] over spacetime $$X$$. The first Chern class of the principle bundle is quantized as the magnetic charge whose induced force the electron feels. This is a prerequisite to the quantization of the electron dynamics and is an example of pre-quantization.
*** The coupling of quarks to the week and strong nuclear forces is described locally by a $$\mathfrak{su}(n)$$ Lie algebra valued 1-form $$A_U$$ from which the strength of the nuclear force field is encoded by the 2-form $$F|_U = dA_U + 1/2 [ A_U  \wedge A_U ]$$. For the consistent quantization of quarks as required for the global definition of Wilson loop observables, this local data must be lifted to an $$SU(n)$$-principal connection on a $$SU(n)$$-[[file:principal_bundle.org][principal bundle]] over spacetime $$X$$. The second Chern class of this bundle is quantized and is physically interpreted as the number of instantons. Instantons are expressed in physics via Chern-Simons 3-forms which are mathematically the pre-quantization of the 4-form $$ \mathrm{tr}(F \wedge F)$$ to a 2-gerbe with 2-connection.
*** [[file:baryogenesis.org][baryogenesis]]
** 1.2 The principle of extremal action * comonadically
** 1.3 The global action functional * cohomologically
** 1.4 The covariant phase space * transgressively
** 1.5 The evolution * correspondingly
* 2. Examples of prequantum field theory
** 2.1 Gauge fields
** 2.2 Sigma-model field theories
** 2.3 Chern-Simons type field theory
** 2.4 Wess-Zumino-Witten type field theory
* 3. Abstract prequantum field theory
** 3.1 Modal homotopy theory
** 3.2 Abstract differential cohomology
** 3.3 Abstract differential geometry
** 3.4 Abstract PDE theory
