content/posts/Higher_prequantum_geometry_by_Urs_Schreiber_in_2017.md
+++
title = "Higher prequantum geometry by Urs Schreiber in 2017"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:40-04:00
slug = "Higher_prequantum_geometry_by_Urs_Schreiber_in_2017"
draft = false
+++

## 1. Prequantum field theory {#1-dot-prequantum-field-theory}


### 1.1 The need for prequantum geometry {#1-dot-1-the-need-for-prequantum-geometry}

<!--list-separator-->

-  The Faraday tensor \\[F\\] encodes the classical Lorentz force that the electromagnetic field on a spacetime \\[X\\] exerts on an electron (propagating in that field).

<!--list-separator-->

-  Within a particular region \\[U\\] the quantum electron couples to the vector potential which is a differential 1-form \\[A\_U\\], such that \\[dA\_U = F|\_U\\]. This is to say that the differential of the vector potential within the region \\[U\\] is equivalent to the restriction of the global Faraday tensor \\[F\\] to the given region.

<!--list-separator-->

-  To define the quantized electron globally requires lifting of the locally defined vector potentials to an \\[\mathbb{R}/\mathbb{Z}\\]-principal connection on a \\[\mathbb{R}/\mathbb{Z}\\]-[principal bundle]({{< relref "principal_bundle" >}}) over spacetime \\[X\\]. The first Chern class of the principle bundle is quantized as the magnetic charge whose induced force the electron feels. This is a prerequisite to the quantization of the electron dynamics and is an example of pre-quantization.

<!--list-separator-->

-  The coupling of quarks to the week and strong nuclear forces is described locally by a \\[\mathfrak{su}(n)\\] Lie algebra valued 1-form \\[A\_U\\] from which the strength of the nuclear force field is encoded by the 2-form \\[F|\_U = dA\_U + 1/2 [ A\_U  \wedge A\_U ]\\]. For the consistent quantization of quarks as required for the global definition of Wilson loop observables, this local data must be lifted to an \\[SU(n)\\]-principal connection on a \\[SU(n)\\]-[principal bundle]({{< relref "principal_bundle" >}}) over spacetime \\[X\\]. The second Chern class of this bundle is quantized and is physically interpreted as the number of instantons. Instantons are expressed in physics via Chern-Simons 3-forms which are mathematically the pre-quantization of the 4-form \\[ \mathrm{tr}(F \wedge F)\\] to a 2-gerbe with 2-connection.

<!--list-separator-->

-  [baryogenesis]({{< relref "baryogenesis" >}})


### 1.2 The principle of extremal action \* comonadically {#1-dot-2-the-principle-of-extremal-action-comonadically}


### 1.3 The global action functional \* cohomologically {#1-dot-3-the-global-action-functional-cohomologically}


### 1.4 The covariant phase space \* transgressively {#1-dot-4-the-covariant-phase-space-transgressively}


### 1.5 The evolution \* correspondingly {#1-dot-5-the-evolution-correspondingly}


## 2. Examples of prequantum field theory {#2-dot-examples-of-prequantum-field-theory}


### 2.1 Gauge fields {#2-dot-1-gauge-fields}


### 2.2 Sigma-model field theories {#2-dot-2-sigma-model-field-theories}


### 2.3 Chern-Simons type field theory {#2-dot-3-chern-simons-type-field-theory}


### 2.4 Wess-Zumino-Witten type field theory {#2-dot-4-wess-zumino-witten-type-field-theory}


## 3. Abstract prequantum field theory {#3-dot-abstract-prequantum-field-theory}


### 3.1 Modal homotopy theory {#3-dot-1-modal-homotopy-theory}


### 3.2 Abstract differential cohomology {#3-dot-2-abstract-differential-cohomology}


### 3.3 Abstract differential geometry {#3-dot-3-abstract-differential-geometry}


### 3.4 Abstract PDE theory {#3-dot-4-abstract-pde-theory}
